CREATE TABLE test_table (
 name varchar(10) CONSTRAINT namechk CHECK (char_length(name) BETWEEN 4 AND 10),
 surname varchar(50),
 city varchar (50),
 age int CONSTRAINT agechk check (age >0 AND age<=150) 
);

INSERT INTO test_table VALUES 
 ('Вячеслав','Дмитриев','Можайск', 22),
( 'Оскар','Поляков','Рязань',100),
( 'Ипполит' ,'Максимов','Москва',21),
( 'Азарий', 'Кириллов','Вологда',20),
( 'Бенедикт','Пестов','Рязань',21),
('Георгий','Медведев','Калининград',24),
('Николай', 'Авдеев', 'Кострома',22),
( 'Самуил' ,'Лебедев','Москва',1),
( 'Лазарь','Котов' ,'Сыктывкар',20),
( 'Нисон' ,'Акаров','Москва',123),
( 'Евдоким','Лобанов' ,'Кострома',90),
( 'Ираклий', 'Иванов','Можайск',145),
( 'Всеволод','Потапов', 'Рязань',19),
( 'Корнелий','Комиссаров' ,'Калининград',21),
('Платон','Селезнёв' , 'Рязань',21),
( 'Семен' ,'Михеев','Вологда',19),
( 'Родион','Тетерин' ,'Кострома',24),
( 'Владимир','Авдеев' ,'Вологда',20),
( 'Вальтер','Ермаков','Калининград',19),
( 'Вячеслав','Рогов' ,'Кострома',21),
( 'Вилли','Беляков' ,'Вологда',119),
( 'Леонард','Шубин' ,'Минск',23),
('Глеб','Кузбнецов' ,'Кострома',24),
('Виктор','Кузнецов', 'Рязань',33),
( 'Антон', 'Журавлёв','Вологда', 75)